#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

module.demo.awslightsail_container_service.awslightsail_container_service: Refreshing state... [id=cq-container-service]
module.demo.awslightsail_bucket.awslightsail_bucket: Refreshing state... [id=cq-lightsail-bucket]
module.demo.awslightsail_lb.awslightsail_lb: Refreshing state... [id=cq_load_ballancer]
module.demo.awslightsail_disk.awslightsail_disk: Refreshing state... [id=cq_awslightsail_disk]
module.demo.awslightsail_certificate.awslightsail_certificate: Refreshing state... [id=cq_awslightsail_certificate]
module.demo.awslightsail_database.awslightsail_database: Refreshing state... [id=cq-lightsail-database]
module.demo.awslightsail_container_deployment.awslightsail_container_deployment: Refreshing state... [id=cq-container-service]
module.demo.aws_lightsail_static_ip.aws_lightsail_static_ip: Refreshing state... [id=cq_static_ip]
module.demo.aws_lightsail_key_pair.aws_lightsail_key_pair: Refreshing state... [id=cq_key_pair]
module.demo.aws_lightsail_instance.aws_lightsail_instance: Refreshing state... [id=cq-lightsaleinstance]
module.demo.aws_lightsail_static_ip_attachment.test: Refreshing state... [id=cq_static_ip]
module.demo.awslightsail_lb_attachment.test: Refreshing state... [id=cq_load_ballancer_cq-lightsaleinstance]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.demo.aws_lightsail_instance.aws_lightsail_instance must be replaced
-/+ resource "aws_lightsail_instance" "aws_lightsail_instance" {
      ~ arn                = "arn:aws:lightsail:us-east-1:707066037989:Instance/1a9bb861-8b67-4945-a35c-ef2af24a2fc8" -> (known after apply)
      ~ cpu_count          = 1 -> (known after apply)
      ~ created_at         = "2022-06-23T11:28:38Z" -> (known after apply)
      ~ id                 = "cq-lightsaleinstance" -> (known after apply)
      ~ ipv6_address       = "2600:1f18:980:4301:5eeb:feeb:b1b7:11a2" -> (known after apply)
      ~ ipv6_addresses     = [
          - "2600:1f18:980:4301:5eeb:feeb:b1b7:11a2",
        ] -> (known after apply)
      ~ is_static_ip       = true -> (known after apply)
      ~ name               = "cq-lightsaleinstance" -> "cq-lightsailinstance" # forces replacement
      ~ private_ip_address = "172.26.20.190" -> (known after apply)
      ~ public_ip_address  = "34.197.132.4" -> (known after apply)
      ~ ram_size           = 0.5 -> (known after apply)
      ~ tags               = {
          + "foo1" = "bar1"
          + "foo2" = ""
        }
      ~ tags_all           = {
          + "foo1" = "bar1"
          + "foo2" = (known after apply)
        }
      ~ username           = "ec2-user" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.demo.aws_lightsail_static_ip_attachment.test must be replaced
-/+ resource "aws_lightsail_static_ip_attachment" "test" {
      ~ id             = "cq_static_ip" -> (known after apply)
      ~ instance_name  = "cq-lightsaleinstance" -> (known after apply) # forces replacement
      ~ ip_address     = "34.197.132.4" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.demo.awslightsail_disk.awslightsail_disk must be replaced
-/+ resource "awslightsail_disk" "awslightsail_disk" {
      ~ arn               = "arn:aws:lightsail:us-east-1:707066037989:Disk/5510b71c-820b-4beb-be08-031a0baa0cd1" -> (known after apply)
      ~ availability_zone = "us-east-1a" -> "us-east-1b" # forces replacement
      ~ created_at        = "2022-06-23T11:28:31Z" -> (known after apply)
      ~ id                = "cq_awslightsail_disk" -> (known after apply)
        name              = "cq_awslightsail_disk"
      ~ tags              = {
          + "foo1" = "bar1"
          + "foo2" = ""
        }
      ~ tags_all          = {
          + "foo1" = "bar1"
          + "foo2" = (known after apply)
        }
        # (1 unchanged attribute hidden)
    }

  # module.demo.awslightsail_disk_attachment.test will be created
  + resource "awslightsail_disk_attachment" "test" {
      + disk_name     = "cq_awslightsail_disk"
      + disk_path     = "/dev/xvdf"
      + id            = (known after apply)
      + instance_name = "cq-lightsailinstance"
    }

  # module.demo.awslightsail_domain.awslightsail_domain will be created
  + resource "awslightsail_domain" "awslightsail_domain" {
      + arn         = (known after apply)
      + domain_name = "mydomain.com"
      + id          = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.demo.awslightsail_lb.awslightsail_lb must be replaced
-/+ resource "awslightsail_lb" "awslightsail_lb" {
      ~ arn               = "arn:aws:lightsail:us-east-1:707066037989:LoadBalancer/3a2cf663-8308-411f-97e2-3497b7c6fd8a" -> (known after apply)
      ~ created_at        = "2022-06-23T11:28:30Z" -> (known after apply)
      ~ dns_name          = "7c8377eb56c07f4fff36c8dc8e83b561-1719117880.us-east-1.elb.amazonaws.com" -> (known after apply)
      ~ id                = "cq_load_ballancer" -> (known after apply)
      ~ name              = "cq_load_ballancer" -> "cq_load_balancer" # forces replacement
      ~ protocol          = "HTTP" -> (known after apply)
      ~ public_ports      = [
          - 80,
        ] -> (known after apply)
      - tags              = {} -> null
      ~ tags_all          = {} -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.demo.awslightsail_lb_attachment.test must be replaced
-/+ resource "awslightsail_lb_attachment" "test" {
      ~ id                 = "cq_load_ballancer_cq-lightsaleinstance" -> (known after apply)
      ~ instance_name      = "cq-lightsaleinstance" -> "cq-lightsailinstance" # forces replacement
      ~ load_balancer_name = "cq_load_ballancer" -> "cq_load_balancer" # forces replacement
    }

Plan: 7 to add, 0 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```

</details>

*Pusher: @hermanschaaf, Action: `pull_request_target`, Working Directory: ``, Workflow: `terraform_plan`*